In [80]:
import pandas as pd, numpy as np, math
from sklearn import linear_model
from word2number import w2n

In [74]:
df=pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [75]:
df.experience.fillna("zero", inplace=True)

In [76]:
df.experience=df.experience.apply(w2n.word_to_num)

In [77]:
df.experience

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [78]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [88]:
median=math.floor(df['test_score(out of 10)'].median())
#median_test_score = math.floor(d['test_score(out of 10)'].mean())
#median_test_score

In [89]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(median)

In [90]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [91]:
reg=linear_model.LinearRegression()

In [94]:
reg.fit(df[['experience','test_score(out of 10)', 'interview_score(out of 10)']],df['salary($)'])

LinearRegression()

In [119]:
t_df=pd.read_csv("t_hiring.csv", skiprows=0)

In [120]:
t_df

   t_experience  t_testscore  t_interviewscore
0             2            9                 6
1            12           10                10
2            24            2                34

TypeError: predict() missing 1 required positional argument: 'X'